; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 390218 1 1 3 5 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(pointing satellite0 Star8)
	(have_image Star5 spectrograph1)
	(have_image Phenomenon6 spectrograph0)
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 spectrograph1)
	(have_image Star9 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
3. (turn_to satellite0 groundstation1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 star9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
6. (take_image satellite0 star9 instrument0 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 1 of 6
7. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 2 of 6
8. (take_image satellite0 star8 instrument0 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 3 of 6
9. (turn_to satellite0 star5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star5)
   goals met: 2 of 6
10. (take_image satellite0 star5 instrument0 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 3 of 6
11. (turn_to satellite0 star8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star8)
   goals met: 4 of 6
12. (turn_to satellite0 phenomenon7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 6
13. (take_image satellite0 phenomenon7 instrument0 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 4 of 6
14. (turn_to satellite0 star8 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star8)
   goals met: 5 of 6
15. (turn_to satellite0 phenomenon6 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 6
16. (take_image satellite0 phenomenon6 instrument0 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 5 of 6
17. (turn_to satellite0 star8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star8)
   goals met: 6 of 6
